<?php
$filename = 'taskList.txt';
$tasks = unserialize($_COOKIE['task']);
$file = fopen($filename, w);

$title =
'+----+-------+----------------------------------------------------------------------+
|								    '.$_COOKIE['taskName'].'                                          |
+----+-------+----------------------------------------------------------------------+
| _№ | _часы | _________________Описание подзадания_________________________________|
+----+--------+---------------------------------------------------------------------+';
fwrite($file,$title);

foreach ($tasks as $key => $task) {
$newTask = "\n".'| '.$key.' | '.$tasks[$key]['Time'].' | ____________________'.$tasks[$key]['Body'].'_______________________________ |
+----+-------+----------------------------------------------------------------------+';
    fwrite($file,$newTask);
}
//записываем текст в файл

fclose($file);
echo 'Файл успешно записан';
?>
<br>
<button type="button" onclick="document.location= '/'">Вернуться на главную</button>