<?php
$filename = 'taskList.txt';

$tasks = unserialize($_COOKIE['task']);

$times = unserialize($_COOKIE['time']);

$file = fopen($filename, "w");
$title =
'+----+-------+----------------------------------------------------------------------+
|								    '.$_COOKIE['taskName'].'                                          |
+----+-------+----------------------------------------------------------------------+
| _№ | _часы | _________________Описание подзадания_________________________________|
+----+--------+---------------------------------------------------------------------+';
fwrite($file,$title);

foreach ($tasks as $key => $task) {
$newTask = "\n".'| '.$key.' | '.$times[$key][$key].' | ____________________'.$task[0].'_______________________________ |
+----+-------+----------------------------------------------------------------------+';
    fwrite($file,$newTask);
}
//записываем текст в файл

fclose($file);
echo 'Файл успешно записан';
?>
<br>
<button type="button" onclick="document.location= '/'">Вернуться на главную</button>